In [2]:
import pandas as pd
df = pd.read_excel("pandas_01_day6.xlsx")
print(df)

    Height  Weight Favourite Dish
0      5.0      75        Biryani
1      5.9      75  Karahi Ghosht
2      5.8      72        Biryani
3      5.7      72        Biryani
4      3.0      62        Biryani
..     ...     ...            ...
82     5.0      50  Chicken Pulao
83     5.6      49  Chicken Pulao
84     5.2      48        Biryani
85     5.0      31        Biryani
86     5.0      25        Biryani

[87 rows x 3 columns]

In [6]:
df.head()

  Height Weight Favourite Dish
0    5.8    101  Chicken Pulao
1    6.2     92        Biryani
2    5.9     62  Karahi Ghosht
3    5.9     95  Chicken Pulao
4    5.9     55  Chicken Pulao

In [3]:
df.tail(7)

    Height  Weight Favourite Dish
80     5.2      51    Chapel Kaba
81     5.6      50          Pasta
82     5.0      50  Chicken Pulao
83     5.6      49  Chicken Pulao
84     5.2      48        Biryani
85     5.0      31        Biryani
86     5.0      25        Biryani

In [9]:
df.shape

(87, 3)

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 87 entries, 0 to 86
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Height          87 non-null     object
 1   Weight          87 non-null     object
 2   Favourite Dish  87 non-null     object
dtypes: object(3)
memory usage: 2.2+ KB

In [14]:
df.index

RangeIndex(start=0, stop=87, step=1)

In [15]:
df.columns

Index(['Height', 'Weight', 'Favourite Dish'], dtype='object')

In [17]:
df.describe()

        Height  Weight Favourite Dish
count     87.0      87             87
unique    35.0      47              5
top        5.9      55        Biryani
freq       9.0       6             40

In [18]:
df.T

,0,1,2,3,4,5,6,7,8,9,...,77,78,79,80,81,82,83,84,85,86
Height,5.8,6.2,5.9,5.9,5.9,5.3,5.6,5.9,5.1,5.4,...,5.5,5’11,5'3,5.4,5.5,5.4,5.9,5.4,6.2,5.1
Weight,101,92,62,95,55,59,50,76,78,68,...,85,72,62,55,52,55,75KG,61,68,96
Favourite Dish,Chicken Pulao,Biryani,Karahi Ghosht,Chicken Pulao,Chicken Pulao,Biryani,Pasta,Biryani,Biryani,Biryani,...,Biryani,Karahi Ghosht,Biryani,Pasta,Karahi Ghosht,Pasta,Karahi Ghosht,Biryani,Chicken Pulao,Biryani

In [19]:
df.head(12)

   Height Weight Favourite Dish
0     5.8    101  Chicken Pulao
1     6.2     92        Biryani
2     5.9     62  Karahi Ghosht
3     5.9     95  Chicken Pulao
4     5.9     55  Chicken Pulao
5     5.3     59        Biryani
6     5.6     50          Pasta
7     5.9     76        Biryani
8     5.1     78        Biryani
9     5.4     68        Biryani
10   5.11     92  Karahi Ghosht
11    5.7     73        Biryani

In [4]:
df.sort_index(ascending=False)

    Height  Weight Favourite Dish
86     5.0      25        Biryani
85     5.0      31        Biryani
84     5.2      48        Biryani
83     5.6      49  Chicken Pulao
82     5.0      50  Chicken Pulao
..     ...     ...            ...
4      3.0      62        Biryani
3      5.7      72        Biryani
2      5.8      72        Biryani
1      5.9      75  Karahi Ghosht
0      5.0      75        Biryani

[87 rows x 3 columns]

In [5]:
df.sort_values(by="Weight")

    Height  Weight Favourite Dish
86     5.0      25        Biryani
85     5.0      31        Biryani
84     5.2      48        Biryani
83     5.6      49  Chicken Pulao
82     5.0      50  Chicken Pulao
..     ...     ...            ...
11     5.1      96        Biryani
10     5.8     101  Chicken Pulao
9      5.1     103    Chapel Kaba
8      6.0     110    Chapel Kaba
7      6.0     125    Chapel Kaba

[87 rows x 3 columns]

In [6]:
pd.__version__

'2.1.1'

### How to make DataFrame 
###### As of now, we read excel data in to datafram. But now, we will create one inside our code.
> For that, we need to use pd method, and in the argument we will pass dictionary. In the dictionary
> The KEY >> Colname
> The VALUE >> list of values in the column


  |  A column  | B column   |
  |:---------: | :--------: |
  |   3        |     4      |
  |   2        |     5      |

In [7]:
df = pd.DataFrame({'A column':[3,2] , 'B column':[4,5] })
df

   A column  B column
0         3         4
1         2         5

##### We Can create a two dimentional array as we create dataframe using **NUMPY**.

> Here we will 2D array, where 3 rows, 4 cols are there.

In [8]:
import numpy as np

In [10]:
arr = np.array([[1,2,3,4], [5,6,7,8], [8,8,7,6]])
arr

array([[1, 2, 3, 4],
       [5, 6, 7, 8],
       [8, 8, 7, 6]])

In [11]:
np.shape(arr)

(3, 4)